cmsis-svd/cmsis-svd/data/GigaDevice/GD32E230.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>cyclic redundancy check calculation unit</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40023000</baseAddress>
         <addressBlock>
         <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
          </addressBlock>
          <registers>
             <register>
          <name>DATA</name>
          <displayName>DATA</displayName>
          <description>Data register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>CRC calculation result bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FDATA</name>
          <displayName>FDATA</displayName>
          <description>Free data register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATA</name>
              <description>General-purpose 8-bit data register
              bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>Control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RST</name>
              <description>reset bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PS</name>
              <description>Size of polynomial</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>REV_I</name>
              <description>Reverse input data</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>REV_O</name>
              <description>Reverse output data</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATA</name>
          <displayName>IDATA</displayName>
          <description>Initialization Data Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>IDATA</name>
              <description>CRC calculation initial value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POLY</name>
          <displayName>POLY</displayName>
          <description>Polynomial register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x04C11DB7</resetValue>
          <fields>
            <field>
              <name>POLY</name>
              <description>User configurable polynomial value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>Debug support</description>
      <groupName>DBGMCU</groupName>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ID</name>
          <displayName>ID</displayName>
          <description>MCU Device ID Code Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ID_CODE</name>
              <description>DBG ID code register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL0</name>
          <displayName>CTL0</displayName>
          <description>Debug Control Register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SLP_HOLD</name>
              <description>Sleep mode hold register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSLP_HOLD</name>
              <description>DEEPSLEEP mode hold Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>STB_HOLD</name>
              <description>Standby mode hold Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>FWDGT_HOLD</name>
              <description>FWDGT hold register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>WWDGT_HOLD</name>
              <description>WWDGT hold register</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0_HOLD</name>
              <description>Timer 0 hold register</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER2_HOLD</name>
              <description>Timer 2 hold register</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
           </field>
            <field>
              <name>I2C0_HOLD</name>
              <description>I2C0 hold register</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1_HOLD</name>
              <description>I2C1 hold register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER5_HOLD</name>
              <description>Timer 5 hold register</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER13_HOLD</name>
              <description>Timer 13 hold register</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1</name>
          <displayName>CTL1</displayName>
          <description>Debug Control Register 1</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTC_HOLD</name>
              <description>RTC hold register</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER14_HOLD</name>
              <description>Timer 14 hold register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>TIMER15_HOLD</name>
              <description>Timer 15 hold register</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
             </field>
            <field>
              <name>TIMER16_HOLD</name>
              <description>Timer 16 hold register</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
             </field>            
          </fields>
        </register>
