cmsis-svd/cmsis-svd/data/GigaDevice/GD32E230.svd
     <register>
          <name>IPR25</name>
          <displayName>IPR25</displayName>
          <description>Interrupt Priority Register 25</description>
          <addressOffset>0x319</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_25</name>
              <description>PRI_25</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR26</name>
          <displayName>IPR26</displayName>
          <description>Interrupt Priority Register 26</description>
          <addressOffset>0x31A</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_26</name>
              <description>PRI_26</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR27</name>
          <displayName>IPR27</displayName>
          <description>Interrupt Priority Register 27</description>
          <addressOffset>0x31B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_27</name>
              <description>PRI_27</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR28</name>
          <displayName>IPR28</displayName>
          <description>Interrupt Priority Register 28</description>
          <addressOffset>0x31C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_28</name>
              <description>PRI_28</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR29</name>
          <displayName>IPR29</displayName>
          <description>Interrupt Priority Register 29</description>
          <addressOffset>0x31D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_29</name>
              <description>PRI_29</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR30</name>
          <displayName>IPR30</displayName>
          <description>Interrupt Priority Register 30</description>
          <addressOffset>0x31E</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_30</name>
              <description>PRI_30</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR31</name>
          <displayName>IPR31</displayName>
          <description>Interrupt Priority Register 31</description>
          <addressOffset>0x31F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_31</name>
              <description>PRI_31</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>    
      </registers>
    </peripheral>
    <peripheral>
      <name>PMU</name>
      <description>Power management unit</description>
      <groupName>PMU</groupName>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>power control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00004000</resetValue>
          <fields>     
           <field>
              <name>LDOVS</name>
              <description>LDO output voltage select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>   
            <field>
              <name>BKPWEN</name>
              <description>Backup Domain Write Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LVDT</name>
              <description>Low Voltage Detector Threshold</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LVDEN</name>
              <description>Low Voltage Detector Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STBRST</name>
              <description>Standby Flag Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WURST</name>
              <description>Wakeup Flag Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STBMOD</name>
              <description>Standby Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDOLP</name>
              <description>LDO Low Power Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CS</name>
          <displayName>CS</displayName>
          <description>power control/status register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>      
            <field>
              <name>WUPEN6</name>
              <description>WKUP pin6 Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN5</name>
              <description>WKUP pin5 Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>       
           <field>
              <name>WUPEN1</name>
              <description>WKUP pin1 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN0</name>
              <description>WKUP pin0 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDF</name>
              <description>Low Voltage Detector Status Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBF</name>
              <description>Standby flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF</name>
              <description>Wakeup flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
